insert into public.cafes (id, name, address, location, tel, business_area, type, tags, rating, cost, image_url, adcode, pcode, cityname) values
(1, '星巴克臻选(上海烘焙工坊)', '南京西路789号N110至N201单元', '121.462437,31.230429', '4008206998', '淮海路', '星巴克咖啡', ARRAY['餐饮服务','咖啡厅','星巴克咖啡'], 4.8, 30.00, 'https://store.is.autonavi.com/showpic/13fb8bfa3aee7b700000002616920195?type=pic', '310106', '310000', '上海市'),
(2, 'Manner Coffee(国客滨江店)', '国客中心码头海事塔区域', '121.496263,31.245597', '13003185954', '北外滩', '咖啡厅', ARRAY['餐饮服务','咖啡厅','咖啡厅'], 4.8, 20.00, 'https://aos-comment.amap.com/B0J0KZZEDK/comment/20260314-6c0b0849f7302f57d0da921b-5VFALV9Ejpc9PKPDDcHe1h.jpg', '310109', '310000', '上海市'),
(3, 'Peet''s皮爷咖啡(愚园路店)', '愚园路108号', '121.445790,31.224767', '13524620080', '静安寺', '咖啡厅', ARRAY['餐饮服务','咖啡厅','咖啡厅'], 4.7, 39.00, 'https://aos-comment.amap.com/B0FFLAYZI2/comment/cef32611725085e849a395f662a19ca1_2048_2048_80.jpg', '310106', '310000', '上海市'),
(4, '看得到风景的咖啡馆(上海白玉兰广场店)', '东大名路501号上海白玉兰广场购物中心', '121.498106,31.248942', '021-55669277', '提篮桥', '咖啡厅', ARRAY['餐饮服务','咖啡厅','咖啡厅'], 4.7, 58.00, 'https://aos-comment.amap.com/B0HACZV5AL/comment/585E3EDA_E885_40E8_B5B4_EB111C25E94B_L0_001_1500_200_1756345570549_19572531.jpg', '310109', '310000', '上海市'),
(5, '小乔治咖啡馆(延安西路1782弄1-4号小区店)', '延安西路1782弄1-4号小区西北1门旁', '121.414777,31.207429', '021-52242933', '新华路', '咖啡厅', ARRAY['餐饮服务','咖啡厅','咖啡厅'], 4.7, 67.00, 'https://store.is.autonavi.com/showpic/3bf6f180010244240000000728914479?type=pic', '310105', '310000', '上海市'),
(6, 'Plusone咖啡(巨鹿路Landing店)', '巨鹿路794号(静安寺地铁站8号口步行360米)', '121.450136,31.219646', '17321478621', '静安寺', '咖啡厅', ARRAY['餐饮服务','咖啡厅','咖啡厅'], 4.7, 65.00, 'https://store.is.autonavi.com/showpic/c513b7c30b8813680000000730330888?type=pic', '310106', '310000', '上海市'),
(7, 'MOCHA猫咪咖啡(长宁中心店)', '安顺路118号-7(虹桥路地铁站号口步行490米)', '121.420018,31.202055', '021-52580706', '湖南路', '咖啡厅', ARRAY['餐饮服务','咖啡厅','咖啡厅'], 4.7, 55.00, 'https://aos-comment.amap.com/B0G2OCI9TL/comment/47A91480_3AF7_478D_9822_8ABADDC99FB8_L0_001_1179_68_1771883382519_31353681.jpg', '310105', '310000', '上海市')
on conflict (id) do nothing;

select setval('cafes_id_seq', (select max(id) from public.cafes));
